import Layout from '../components/Layouts'
import HeroSlider from '../components/HeroSlider';
import DealSlider from '../components/DealSlider';
import TagsSlider from '../components/TagsSlider';
import TagsTabs from '../components/TagsTabs';
import CatsSlider from '../components/CatsSlider';
import BrandsSlider from '../components/BrandsSlider';
import ProductsSlider from '../components/ProductsSlider';
import Link from 'next/link';
import Image from 'next/image';
import ReactReadMoreReadLess from "react-read-more-read-less";

const myLongText = "بیبی شیک عرضه کننده برترین برند های اروپایی همراه با مناسب ترین قیمت و عالی ترین کیفیت، یک فروشگاه اینترنتی تخصصی لباس بچه گانه شیک است که به صورت آنلاین فعالیت دارد. ما در تمامی مراحل رشد نوزادان از بدو تولد تا سنین بالاتر را در کنار والدین و به ویژه مادران باردار هستیم. تمامی مادران می توانند با توجه به نیازهای فرزندشان و با در نظر گرفتن سلایق شخصی خود برای خرید لباس بچه گانه به بیبی شیک شاپ مراجعه کرده و به صورت آنلاین پوشاک کودک خود را تهیه کنند.بیبی شیک شاپ با در نظر گرفتن نیاز تمامی کودکان، سلایق والدین، جثه و ویژگی های ظاهری که در افراد مختلف یکسان نیست، سعی کرده است تا محصولات متنوعی را به مشتریان خود ارائه دهد. تنوع لباس هایی که در این فروشگاه عرضه می شود بسیار بالاست و مطمئنا تمامی والدین با هر نوع سلیقه ای تنها پس از یکبار بازدید محصولات این فروشگاه دست خالی از آن خارج نمی شوند و خرید پوشاک بچه گانه شیک برای فرزند خود را انجام می دهند.سبد لباسی که بیبی شیک شاپ برای شما عزیزان در نظر گرفته است، شامل تمامی مدل های لباس بچه گانه نظیر پیراهن و سارفون دخترانه، انواع شلوار و لگ دخترانه و پسرانه، انواع تیشرت و بلوز آستین بلند دخترانه و پسرانه، انواع ست های پسرانه و دخترانه، انواع بادی، انواع سرهمی، رامپر و بیلرهای زیبای دخترانه و پسرانه و… می شود که خرید اینترنتی لباس بچه گانه شیک و اورجینال را بسیار آسان تر و بی درد سرتر می کند.تمامی محصولات ما به صورت آنلاین ارائه می شود. بنابراین شما عزیزان در صورت خرید پوشاک کودک از بیبی شیک شاپ می توانید بدون محدودیت زمانی و در تمامی ساعات شبانه روز، خرید خود را ثبت کنید و آن را در هر نقطه ای از ایران و از طریق پست تحویل بگیرید. مطمئن باشید هر آن چه را که در بیبی شیک شاپ سفارش می دهید، بسیار باکیفیت و دارای دوام بالا است، چراکه تمامی محصولات ما اورجینال و از بهترین برندهای معروف لباس بچه گانه هستند.بزرگترین مزیت خرید از این فروشگاه، قیمت لباس بچه گانه بسیار مناسب است. بدون تردید یکی از مهم ترین فاکتورها در خرید برای والدین، قیمت لباس بچه گانه است. زمانی که شما یک لباس بسیار زیبا، شیک، باکیفیت و اورجینال در حالی که قیمت ارزان و مناسبی دارد را ملاحظه می کنید، شگفت زده می شوید و بلافاصله آن را خریداری می کنید."

function HomePage({products, tags}){

return(
  <>
<Layout title='بیبی شیک شاپ: فروشگاه آنلاین خرید لباس بچه گانه اورجینال'>



  <HeroSlider></HeroSlider>

  <TagsSlider tags={tags}/>

  <div className='flex flex-col sm:flex-row w-full'>

  <div className='flex flex-row mt-10 sm:p-10 p-2 rounded-xl bg-girl w-full sm:w-1/2 mx-2 '>
    <Image
    src={'/images/girl.png'} 
    width={250}
    height={300}
    />
      <div className='flex flex-col'>
      <h2 className='text-2xl text-gray-800 block'>محصولات دخترانه</h2>
    <Link href={'/'}>
    <button className='rounded-full border-2 border-pink-500 p-2 my-5'>مشاهده</button>
    </Link>
      </div>
  </div>

  <div className='flex flex-row mt-10 sm:p-10 p-2 rounded-xl bg-boy w-full sm:w-1/2 mx-2 '>
    <Image
    src={'/images/boy.png'}
    width={250}
    height={300}
      />
      <div className='flex flex-col'>
      <h2 className='text-2xl text-gray-800 block'>محصولات پسرانه</h2>
    <Link href={'/'}>
    <button className='rounded-full border-2 border-green-500 p-2 my-5'>مشاهده</button>
    </Link>
      </div>

  </div>

  </div>

  <div className='mt-5 sm:p-2 p-2 rounded-xl'>
    <div className='flex items-stretch'>
  <h2 className='mt-5 text-right text-sm sm:text-2xl font-bold text-gray-700 w-1/2'>  جدیدترین محصولات  </h2>
  <Link className='rounded-3xl mt-5 text-sm sm:text-2xl align-left w-1/2 text-left' href="#">همه محصولات</Link>
    </div>
  <ProductsSlider products={products} />
  </div>



  <div className='flex items-stretch'>
  <h2 className='mt-5 text-right text-sm sm:text-2xl font-bold text-gray-700 w-1/2'>
  محصولات دخترانه
  </h2>
<Link className='mt-5 text-sm sm:text-xl align-left w-1/2 text-left' href="#">همه محصولات</Link>
      </div>
      <div className='flex flex-col sm:flex-row mt-2 sm:p-2 p-5 rounded-xl w-full'>
    <div className='rounded-xl bg-girl w-full sm:w-1/6'>
  <Image
    src={'/images/girl.png'} 
    width={300}
    height={300}
    />
  </div>
  <div className='w-full sm:w-5/6 sm:mr-4'>
  <TagsTabs products={products} />

    </div>
  </div>

  {/* <div className='mb-10 p-5 text-center text-lg font-bold text-gray-800'>
    <h3>
    دسته بندی محصولات دخترانه
    </h3>
  <CatsSlider tags={tags}/>
  </div> */}


  <div className='flex items-stretch'>
  <h2 className='mt-5 text-right text-sm sm:text-2xl font-bold text-gray-700 w-1/2'>
  محصولات پسرانه
  </h2>
<Link className='rounded-3xl mt-5 text-sm sm:text-xl align-left w-1/2 text-left' href="#">همه محصولات</Link>
      </div>

      <div className='flex flex-col sm:flex-row mt-2 sm:p-2 p-5 rounded-xl w-full'>
    <div className='rounded-xl bg-boy w-full sm:w-1/6'>
  <Image
    src={'/images/boy.png'} 
    width={300}
    height={300}
    />
  </div>
  <div className='w-full sm:w-5/6 sm:mr-4'>  <TagsTabs products={products} /></div>
  </div>



  {/* <div className='mb-10 p-5 text-center text-lg font-bold text-gray-800'>
    <h3>
    دسته بندی محصولات پسرانه
    </h3>
    <CatsSlider tags={tags}/>
  </div> */}

  <div className='flex items-stretch'>
  <h2 className='mt-5 text-right text-sm sm:text-2xl font-bold text-gray-700 w-1/2'>
  محصولات اسپرت
  </h2>
<Link className='rounded-3xl mt-5 text-sm sm:text-xl align-left w-1/2 text-left' href="#">همه محصولات</Link>
      </div>

  <div className='flex flex-col sm:flex-row mt-2 sm:p-2 p-5 rounded-xl w-full'>
    <div className='rounded-xl bg-sport w-full sm:w-1/6'>
  <Image
    src={'/images/sport.png'} 
    width={300}
    height={300}
    />
  </div>
  <div className='w-full sm:w-5/6 sm:mr-4'>  <TagsTabs products={products} /> </div>
  </div>
{/* 
  <div className='mb-10 p-5 text-center text-lg font-bold text-gray-800'>
    <h3>
    دسته بندی محصولات اسپرت
    </h3>
    <CatsSlider tags={tags}/>
    </div> */}


    <div className='flex flex-row rounded-xl p-3 bg-gradient-to-r from-yellow-700 to-green-950'>
    <div className='deal-bg rotate-180 text-white text-right basis-4/12'>
    </div>
    <h3 className='text-white text-center text-sm sm:text-2xl font-bold basis-4/12'>
      تخفیف ویژه
    </h3>
    <div className='deal-bg text-white text-left basis-4/12'>
    </div>
  </div>

  <DealSlider />



  <h2 className='mt-5 text-center text-2xl font-bold text-gray-800'>
برندها 
    </h2>  
  <BrandsSlider></BrandsSlider>

  <div className='flex flex-col rounded-xl p-3'>
    <h2 className='text-center text-2xl mb-4'>    فروشگاه اینترنتی لباس بچه گانه بیبی شیک شاپ
</h2>

<ReactReadMoreReadLess
                charLimit={400}
                readMoreText={"بیشتر ▼"}
                readLessText={"کمتر ▲"}
            >
                {myLongText}

</ReactReadMoreReadLess>

  </div>
  <div className="flex flex-row mx-auto justify-center text-center">
                <div className="p-4"><svg xmlns="http://www.w3.org/2000/svg" width="54" height="36" viewBox="0 0 54 36" fill="none"> <path d="M53.7161 18.5266C53.7161 18.5166 53.7161 18.5066 53.7161 18.4965C53.7115 18.1735 53.5812 17.8654 53.3533 17.639C53.1255 17.4126 52.8185 17.2862 52.4991 17.2873H52.1793L47.2335 7.62639C47.1306 7.42594 46.975 7.25807 46.7838 7.14126C46.5926 7.02445 46.3733 6.96322 46.15 6.96429H37.7111L38.0329 4.38339C38.0856 3.88989 38.0341 3.3907 37.8818 2.91883C37.7295 2.44696 37.4799 2.01316 37.1494 1.64611C36.819 1.27906 36.4153 0.98712 35.965 0.789603C35.5147 0.592087 35.028 0.493493 34.5372 0.500333H8.3453C8.02531 0.502063 7.7173 0.623604 7.48072 0.841499C7.24414 1.05939 7.09577 1.35819 7.06425 1.68021L6.79998 3.80614H21.7247C21.9533 3.80494 22.1798 3.85038 22.3907 3.93973C22.6016 4.02908 22.7924 4.1605 22.9519 4.32615C23.1114 4.4918 23.2362 4.68827 23.3189 4.90382C23.4016 5.11936 23.4405 5.34956 23.4332 5.58064C23.4187 6.05457 23.2229 6.50434 22.8872 6.83529C22.5514 7.16625 22.1017 7.3526 21.6329 7.35514H16.6553V7.36249H2.04111C1.70988 7.36421 1.3922 7.49568 1.1548 7.72927C0.917396 7.96287 0.778752 8.28041 0.767988 8.6152C0.762652 8.77873 0.790007 8.94167 0.848415 9.09425C0.906823 9.24684 0.995083 9.38594 1.10791 9.50321C1.22073 9.62049 1.35581 9.71353 1.50503 9.77677C1.65426 9.84001 1.81457 9.87214 1.97637 9.87124H21.3276C21.7675 9.93884 22.1677 10.1672 22.4523 10.513C22.737 10.8589 22.8864 11.2982 22.8723 11.748C22.8565 12.2533 22.6484 12.733 22.2915 13.0869C21.9345 13.4409 21.4562 13.6419 20.9563 13.6481H7.6179C7.28261 13.6498 6.96109 13.7832 6.72112 14.02C6.48116 14.2568 6.34149 14.5786 6.33156 14.9175C6.32604 15.0827 6.35357 15.2473 6.4125 15.4015C6.47142 15.5557 6.56053 15.6963 6.67448 15.8149C6.78842 15.9334 6.92487 16.0275 7.07563 16.0914C7.22639 16.1553 7.38836 16.1878 7.55183 16.1869H20.7363C21.1805 16.2488 21.5863 16.4744 21.8761 16.8204C22.1658 17.1664 22.3189 17.6084 22.3061 18.0616C22.2904 18.5693 22.0805 19.0511 21.7207 19.4056C21.361 19.7601 20.8792 19.9597 20.3769 19.9624H5.25333H3.98219C3.6469 19.9641 3.32538 20.0975 3.08541 20.3343C2.84544 20.5711 2.70577 20.8929 2.69585 21.2318C2.69033 21.397 2.71786 21.5617 2.77678 21.7159C2.83571 21.8701 2.92482 22.0106 3.03876 22.1292C3.15271 22.2477 3.28916 22.3418 3.43992 22.4057C3.59068 22.4696 3.75265 22.5021 3.91612 22.5012H5.01285L4.58406 27.0403C4.53147 27.5338 4.58305 28.0329 4.73539 28.5047C4.88773 28.9765 5.13736 29.4102 5.46777 29.7772C5.79819 30.1441 6.20188 30.436 6.65214 30.6335C7.1024 30.831 7.58898 30.9296 8.07971 30.9227H9.02646C9.24863 32.2089 9.91372 33.374 10.904 34.2117C11.8942 35.0495 13.1457 35.5058 14.4368 35.4999C15.75 35.4907 17.0217 35.0338 18.0464 34.2032C19.0711 33.3726 19.7888 32.2169 20.0836 30.9227H31.8906C32.833 30.9142 33.7423 30.5695 34.4579 29.9493C35.1162 30.5835 35.9933 30.9327 36.9025 30.9227H37.0967C37.3189 32.2089 37.984 33.374 38.9742 34.2117C39.9644 35.0495 41.2159 35.5058 42.507 35.4999C43.8202 35.4907 45.0919 35.0338 46.1166 34.2032C47.1413 33.3726 47.859 32.2169 48.1538 30.9227H48.9314C49.9337 30.9032 50.8946 30.5144 51.6335 29.8294C52.3725 29.1443 52.8389 28.2101 52.945 27.202L53.7088 18.6502C53.7088 18.6388 53.7088 18.6275 53.7088 18.6155C53.7088 18.6034 53.7121 18.5807 53.7127 18.5627C53.7134 18.5446 53.7161 18.5366 53.7161 18.5266ZM14.5022 32.9631C14.094 32.9649 13.6897 32.8836 13.3134 32.724C12.937 32.5644 12.5963 32.3297 12.3116 32.034C12.0268 31.7384 11.8039 31.3877 11.6561 31.003C11.5082 30.6183 11.4385 30.2075 11.4512 29.795C11.4781 28.949 11.828 28.1466 12.4274 27.5559C13.0268 26.9652 13.8291 26.6322 14.666 26.6268C15.0741 26.625 15.4784 26.7063 15.8548 26.8659C16.2312 27.0256 16.5719 27.2602 16.8566 27.5559C17.1414 27.8516 17.3643 28.2022 17.5121 28.5869C17.6599 28.9716 17.7296 29.3824 17.717 29.795C17.6901 30.6409 17.3402 31.4433 16.7408 32.034C16.1414 32.6247 15.3391 32.9577 14.5022 32.9631ZM42.5737 32.9631C42.1656 32.9649 41.7613 32.8836 41.3849 32.724C41.0086 32.5644 40.6679 32.3297 40.3831 32.034C40.0984 31.7384 39.8754 31.3877 39.7276 31.003C39.5798 30.6183 39.5101 30.2075 39.5227 29.795C39.5497 28.949 39.8996 28.1466 40.4989 27.5559C41.0983 26.9652 41.9006 26.6322 42.7376 26.6268C43.1457 26.625 43.55 26.7063 43.9263 26.8659C44.3027 27.0256 44.6434 27.2602 44.9282 27.5559C45.2129 27.8516 45.4358 28.2022 45.5837 28.5869C45.7315 28.9716 45.8012 29.3824 45.7886 29.795C45.7616 30.6409 45.4117 31.4433 44.8123 32.034C44.2129 32.6247 43.4106 32.9577 42.5737 32.9631ZM50.451 27.0377C50.409 27.4014 50.239 27.7376 49.9722 27.9852C49.7054 28.2327 49.3594 28.3749 48.9975 28.3859H48.1571C47.8797 27.1621 47.1987 26.0702 46.2261 25.2898C45.2535 24.5094 44.0472 24.0869 42.8056 24.092C41.5418 24.1008 40.3149 24.5242 39.3094 25.2985C38.3039 26.0728 37.574 27.1562 37.2295 28.3859H36.9712C36.8216 28.3893 36.6729 28.3608 36.5349 28.3022C36.397 28.2436 36.2728 28.1563 36.1704 28.0458C36.0702 27.9315 35.9949 27.797 35.9494 27.6513C35.9039 27.5056 35.8891 27.3519 35.9062 27.2L37.4865 9.4951H41.1156L40.5408 15.9424C40.4881 16.4359 40.5396 16.935 40.6919 17.4069C40.8442 17.8788 41.0938 18.3126 41.4242 18.6796C41.7547 19.0467 42.1584 19.3386 42.6087 19.5361C43.059 19.7337 43.5457 19.8323 44.0365 19.8254H51.0945L50.451 27.0377Z" fill="#3A3A3A"></path> </svg>ارسال سریع</div>
                <div className="p-4"><svg xmlns="http://www.w3.org/2000/svg" width="37" height="40" viewBox="0 0 37 40" fill="none"> <path d="M34.8256 15.9752C34.5627 7.12165 27.2793 0 18.3631 0C9.44697 0 2.16359 7.12165 1.90061 15.9752L0.716064 17.1598V25.1932L1.89254 26.3696V31.8431C1.89254 35.0435 4.49614 37.6471 7.69646 37.6471H9.15371C9.63936 39.0164 10.947 40 12.4808 40H14.8337C16.3685 40 17.6769 39.015 18.1617 37.6442C18.2289 37.6454 18.2963 37.6471 18.3631 37.6471C24.0445 37.6471 28.7983 33.5987 29.8913 28.2353H32.9681L36.0102 25.1932V17.1598L34.8256 15.9752ZM18.3631 2.35294C25.3459 2.35294 31.1601 7.44933 32.2836 14.1176H29.8913C28.7983 8.7542 24.0445 4.70588 18.3631 4.70588C12.6817 4.70588 7.92799 8.7542 6.83497 14.1176H4.44265C5.56618 7.44933 11.3803 2.35294 18.3631 2.35294ZM27.4771 14.1176C23.674 14.1063 20.9878 14.3379 18.773 11.1004L17.6976 9.52839L16.7733 11.1938C15.4267 13.6204 13.6131 14.1176 11.3043 14.1176H9.24916C10.2966 10.0629 13.9856 7.05882 18.3631 7.05882C22.7406 7.05882 26.4296 10.0629 27.4771 14.1176ZM6.59842 25.8824H4.73277L3.06901 24.2186V18.1344L4.73277 16.4706H6.59842V25.8824ZM4.24548 31.8431V28.2353H6.83269C7.27559 30.4294 8.33528 32.4435 9.90516 34.0611C9.57607 34.4127 9.31795 34.8311 9.15371 35.2941H7.69646C5.79356 35.2941 4.24548 33.746 4.24548 31.8431ZM14.8337 37.6471H12.4808C11.832 37.6471 11.3043 37.1194 11.3043 36.4706C11.3043 35.8219 11.832 35.2941 12.4808 35.2941H14.8337C15.4824 35.2941 16.0102 35.8219 16.0102 36.4706C16.0102 37.1194 15.4824 37.6471 14.8337 37.6471ZM27.7749 25.8824C27.7749 31.072 23.5528 35.2941 18.3631 35.2941C18.2957 35.2941 18.2277 35.2928 18.1598 35.2912C17.6733 33.9234 16.3663 32.9412 14.8337 32.9412C12.418 32.9465 12.4565 32.9291 12.1554 32.9568C10.1129 31.1665 8.95136 28.6166 8.95136 25.8824V16.4706H11.3043C13.3864 16.4706 15.9221 16.1273 17.8849 13.7384C20.4747 16.4524 23.6396 16.4706 26.4806 16.4706H27.7749V25.8824ZM33.6572 24.2186L31.9935 25.8824H30.1278V16.4706H31.9935L33.6572 18.1344V24.2186Z" fill="#3A3A3A"></path> </svg>پشتیبانی</div>
                <div className="p-4"><svg xmlns="http://www.w3.org/2000/svg" width="41" height="40" viewBox="0 0 41 40" fill="none"> <g clipPath="url(#clip0_269_17)"> <path d="M37.6659 20.7348V2.51992C37.6659 1.87009 37.1391 1.34326 36.4893 1.34326H4.96405C4.31422 1.34326 3.78739 1.87009 3.78739 2.51992V22.1868C3.21977 22.2695 2.66486 22.4899 2.17395 22.8543C0.62641 23.9517 0.260391 26.4074 1.55668 27.922L6.85659 34.3471C10.1373 38.1867 13.6223 38.6571 18.8032 38.6571C23.2492 38.6571 25.2369 38.6767 29.1116 37.7938L32.8846 36.8914C33.4964 37.7457 34.4676 38.2992 35.5595 38.2992H37.4181C39.2649 38.2992 40.7673 36.7164 40.7673 34.7709V24.2524C40.7674 22.3948 39.3973 20.8689 37.6659 20.7348ZM32.3771 23.1552L30.8093 22.359C28.2316 21.0578 25.2512 21.0096 22.6328 22.227C21.9184 22.508 20.3602 23.4507 19.552 23.4192H14.1118C12.3073 23.4192 10.8391 24.8873 10.8391 26.6919V27.55C10.829 27.5393 10.8184 27.5292 10.8084 27.5184L6.9235 23.3015C6.6884 23.0463 6.42428 22.8328 6.14079 22.6614V10.9875H15.77V15.3008C15.77 15.9506 16.2969 16.4775 16.9467 16.4775H24.3715C25.0213 16.4775 25.5481 15.9506 25.5481 15.3008V10.9875H35.3127V20.7347C33.9379 20.8409 32.7915 21.8244 32.3771 23.1552ZM18.1233 10.9875H23.1947V14.1241H18.1233V10.9875ZM35.3126 8.63416H25.5481V3.69658H35.3127V8.63416H35.3126ZM23.1948 3.69658V8.63424H18.1233V3.69658H23.1948ZM15.7699 3.69658V8.63424H6.14071V3.69658H15.7699ZM28.5655 35.5047C24.9861 36.3245 22.8304 36.2913 18.8454 36.2913C13.9819 36.2913 11.6319 36.2127 8.6721 32.8495L3.37218 26.4244C2.45031 25.224 4.12007 23.8069 5.19271 24.8958L9.07765 29.1128C10.1044 30.1962 11.3965 30.7925 12.9889 30.8275H23.7599C24.4098 30.8275 24.9366 30.3007 24.9366 29.6509C24.9366 29.001 24.4098 28.4742 23.7599 28.4742H13.1924V26.6917C13.1924 26.1848 13.6047 25.7724 14.1117 25.7724H19.552C20.7776 25.8601 22.5466 24.8368 23.6249 24.3608C25.586 23.449 27.8182 23.4851 29.7462 24.4583L32.2105 25.7099V34.6328L28.5655 35.5047ZM38.4141 34.7708C38.4141 35.4187 37.9673 35.9458 37.4182 35.9458H35.5596C35.0104 35.9458 34.5638 35.4187 34.5638 34.7708V24.2524C34.5638 23.6046 35.0105 23.0774 35.5596 23.0774H37.4182C37.9673 23.0774 38.4141 23.6045 38.4141 24.2524V34.7708Z" fill="#3A3A3A"></path> </g> <defs> <clipPath id="clip0_269_17"> <rect width="40" height="40" fill="white" transform="translate(0.767334)"></rect> </clipPath> </defs> </svg>پرداخت امن</div>
                <div className="p-4"><svg xmlns="http://www.w3.org/2000/svg" width="40" height="40" viewBox="0 0 40 40" fill="none"> <path d="M34.5387 2.34375C33.5867 2.34375 32.6942 2.57414 31.9245 2.97437V1.17188C31.9245 0.524687 31.3392 0 30.6173 0H9.70326C8.98129 0 8.39604 0.524687 8.39604 1.17188V2.98867C7.62021 2.57953 6.71751 2.34375 5.75416 2.34375C2.87115 2.34375 0.525635 4.44656 0.525635 7.03125C0.525635 9.00273 1.17728 10.9077 2.41008 12.5402C4.50881 15.3193 7.09684 16.0405 9.23835 16.8084C10.4732 19.5653 12.9702 21.7502 16.0851 22.7846L15.1212 28.2812H14.9318C12.7695 28.2812 11.0104 29.8584 11.0104 31.7969V37.6562H9.70326C8.98137 37.6562 8.39613 38.1809 8.39613 38.8281C8.39613 39.4753 8.98137 40 9.70326 40H30.6173C31.3392 40 31.9245 39.4753 31.9245 38.8281C31.9245 38.1809 31.3392 37.6562 30.6173 37.6562H29.3102V31.7969C29.3102 29.8584 27.5511 28.2812 25.3888 28.2812H25.1994L24.2356 22.7847C27.355 21.7487 29.8548 19.5591 31.0878 16.7966C33.1108 16.0711 35.7626 15.3478 37.8829 12.5402C39.1157 10.9077 39.7673 9.00266 39.7673 7.03125C39.7673 4.44656 37.4217 2.34375 34.5387 2.34375ZM8.38637 13.9787C5.19923 12.8357 3.1399 10.1087 3.1399 7.03125C3.1399 5.73891 4.31265 4.6875 5.75416 4.6875C7.19566 4.6875 8.36842 5.73891 8.36842 7.03125C8.36842 7.11367 8.37809 7.19398 8.39613 7.27156V12.8906C8.39613 13.2673 8.4187 13.6392 8.46192 14.0058L8.38637 13.9787ZM26.6959 37.6562H13.6246V35.3125H26.6959V37.6562ZM25.3888 30.625C26.1096 30.625 26.6959 31.1507 26.6959 31.7969V32.9688H13.6246V31.7969C13.6246 31.1507 14.211 30.625 14.9318 30.625C15.6409 30.625 23.7257 30.625 25.3888 30.625ZM17.7676 28.2812L18.6325 23.3487C19.1327 23.4071 19.6426 23.4375 20.1603 23.4375C20.678 23.4375 21.1879 23.407 21.6881 23.3487L22.553 28.2812H17.7676ZM29.3102 12.8906C29.3102 17.4138 25.2056 21.0938 20.1603 21.0938C15.115 21.0938 11.0104 17.4138 11.0104 12.8906V7.03125H29.3102V12.8906ZM29.3102 4.6875H11.0104V2.34375H29.3102V4.6875ZM31.9064 13.9787L31.86 13.9953C31.9023 13.6322 31.9244 13.2637 31.9244 12.8906V7.03125C31.9245 5.73891 33.0972 4.6875 34.5387 4.6875C35.9802 4.6875 37.153 5.73891 37.153 7.03125C37.153 10.1087 35.0937 12.8358 31.9064 13.9787Z" fill="#3A3A3A"></path> </svg>تضمین کیفیت کالا</div>
  </div>
</Layout>
  </>
)
}

export async function getServerSideProps(){

  const ProductsRes = await fetch(`${process.env.API_URL}products`)
  const products = await ProductsRes.json()

  const tagsRes = await fetch(`${process.env.API_URL}tags`)
  const tags = await tagsRes.json()

  return { props: { products, tags } }
}

export default HomePage